Tekla.Structures.Internal.SynchronizeInvokeFunctionality
SynchronizeInvokeFunctionality is a part of the remoting implementation for plugins and applications to connect to Tekla Structures
Tekla.Structures.Internal.WrapperFunctionalityBase

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.instance
The _ instance

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.#ctor(System.ComponentModel.ISynchronizeInvoke)
Initializes a new instance of the Tekla.Structures.Internal.SynchronizeInvokeFunctionality class.
Instance: The instance in.
Throws System.ArgumentNullException: Instance is null

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.InvokeRequired
Gets a value indicating whether [invoke required].
true if [invoke required]; otherwise, false.

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke0``1(Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod0{``0})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke1r``2(``0@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod1r{``0,``1})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke1v``2(``0,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod1v{``0,``1})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2rr``3(``0@,``1@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2rr{``0,``1,``2})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2rv``3(``0@,``1,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2rv{``0,``1,``2})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2vr``3(``0,``1@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2vr{``0,``1,``2})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3vvr``4(``0,``1,``2@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3vvr{``0,``1,``2,``3})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3vrr``4(``0,``1@,``2@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3vrr{``0,``1,``2,``3})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke2vv``3(``0,``1,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod2vv{``0,``1,``2})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3rrv``4(``0@,``1@,``2,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3rrv{``0,``1,``2,``3})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4rrvv``5(``0@,``1@,``2,``3,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4rrvv{``0,``1,``2,``3,``4})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3rrr``4(``0@,``1@,``2@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3rrr{``0,``1,``2,``3})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3rvv``4(``0@,``1,``2,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3rvv{``0,``1,``2,``3})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke3vvv``4(``0,``1,``2,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod3vvv{``0,``1,``2,``3})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4vvrr``5(``0,``1,``2@,``3@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4vvrr{``0,``1,``2,``3,``4})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4vvvv``5(``0,``1,``2,``3,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4vvvv{``0,``1,``2,``3,``4})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4rrrv``5(``0@,``1@,``2@,``3,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4rrrv{``0,``1,``2,``3,``4})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4rrrr``5(``0@,``1@,``2@,``3@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4rrrr{``0,``1,``2,``3,``4})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke4vvvr``5(``0,``1,``2,``3@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod4vvvr{``0,``1,``2,``3,``4})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5rrrrr``6(``0@,``1@,``2@,``3@,``4@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5rrrrr{``0,``1,``2,``3,``4,``5})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5rvvvv``6(``0@,``1,``2,``3,``4,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5rvvvv{``0,``1,``2,``3,``4,``5})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5rrvvv``6(``0@,``1@,``2,``3,``4,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5rrvvv{``0,``1,``2,``3,``4,``5})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5vvrrv``6(``0,``1,``2@,``3@,``4,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5vvrrv{``0,``1,``2,``3,``4,``5})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5vvvrr``6(``0,``1,``2,``3@,``4@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5vvvrr{``0,``1,``2,``3,``4,``5})
P0:
P1:
P2:
P3:
P4:
Method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke9rrrrrrrrr``10(``0@,``1@,``2@,``3@,``4@,``5@,``6@,``7@,``8@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod9rrrrrrrrr{``0,``1,``2,``3,``4,``5,``6,``7,``8,``9})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke5vvrrr``6(``0,``1,``2@,``3@,``4@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod5vvrrr{``0,``1,``2,``3,``4,``5})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6vvvrrr``7(``0,``1,``2,``3@,``4@,``5@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6vvvrrr{``0,``1,``2,``3,``4,``5,``6})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6vvrrrr``7(``0,``1,``2@,``3@,``4@,``5@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6vvrrrr{``0,``1,``2,``3,``4,``5,``6})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6vrrrrr``7(``0,``1@,``2@,``3@,``4@,``5@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6vrrrrr{``0,``1,``2,``3,``4,``5,``6})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6rrrrrv``7(``0@,``1@,``2@,``3@,``4@,``5,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6rrrrrv{``0,``1,``2,``3,``4,``5,``6})
p0:
p1:
p2:
p3:
p4:
p5:
method:
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6vvrrvv``7(``0,``1,``2@,``3@,``4,``5,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6vvrrvv{``0,``1,``2,``3,``4,``5,``6})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6rrrrrr``7(``0@,``1@,``2@,``3@,``4@,``5@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6rrrrrr{``0,``1,``2,``3,``4,``5,``6})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6vvvvvv``7(``0,``1,``2,``3,``4,``5,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6vvvvvv{``0,``1,``2,``3,``4,``5,``6})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke6vvvvvr``7(``0,``1,``2,``3,``4,``5@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod6vvvvvr{``0,``1,``2,``3,``4,``5,``6})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke8vvvvvvvv``9(``0,``1,``2,``3,``4,``5,``6,``7,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod8vvvvvvvv{``0,``1,``2,``3,``4,``5,``6,``7,``8})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke16vvvvvvvvvvvvvvvv``17(``0,``1,``2,``3,``4,``5,``6,``7,``8,``9,``10,``11,``12,``13,``14,``15,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod16vvvvvvvvvvvvvvvv{``0,``1,``2,``3,``4,``5,``6,``7,``8,``9,``10,``11,``12,``13,``14,``15,``16})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke17vvvvvvvvvvvvvvvvv``18(``0,``1,``2,``3,``4,``5,``6,``7,``8,``9,``10,``11,``12,``13,``14,``15,``16,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod17vvvvvvvvvvvvvvvvv{``0,``1,``2,``3,``4,``5,``6,``7,``8,``9,``10,``11,``12,``13,``14,``15,``16,``17})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke7vvrrrrr``8(``0,``1,``2@,``3@,``4@,``5@,``6@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod7vvrrrrr{``0,``1,``2,``3,``4,``5,``6,``7})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke7vvvvvvr``8(``0,``1,``2,``3,``4,``5,``6@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod7vvvvvvr{``0,``1,``2,``3,``4,``5,``6,``7})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke7rrrrrrr``8(``0@,``1@,``2@,``3@,``4@,``5@,``6@,Tekla.Structures.Internal.WrapperFunctionalityBase.TargetMethod7rrrrrrr{``0,``1,``2,``3,``4,``5,``6,``7})


Tekla.Structures.Internal.SynchronizeInvokeFunctionality.BeginInvoke(System.Delegate,System.Object[])
Begins the invoke.
Method: The method.
Args: The arguments.
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.EndInvoke(System.IAsyncResult)
Ends the invoke.
Result: The result.
Returns:

Tekla.Structures.Internal.SynchronizeInvokeFunctionality.Invoke(System.Delegate,System.Object[])
Invokes the specified method.
Method: The method.
Args: The arguments.
Returns: returns result of invoke.